package util;

public class PrintUtil {
	static public void title(){
		System.out.println("\n\n□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■\n");
		System.out.println("                                    🍽️ 오늘 뭐먹지? 🍽️\n");
	}
	static public void title2(){
		System.out.println("\n\n□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■\n");
		System.out.println("                                    🍽️ 오늘 뭐먹지? 🍽️");
	}
	
	static public void joystick(){
		System.out.print("\n                           (2)↓ (5)↑ (⏎)확인 \n");
		System.out.print("□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■\n>");
	}
	
	static public void joystick2(){
		System.out.print("     (2)↓ (5)↑ (⏎)확인 \n");
		System.out.print("□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■\n>");
	}
	
	static public void joystick3(){
		System.out.print(" (1,3)← → (⏎)확인 \n");
		System.out.print("□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■\n>");
	}
	
	static public void printBar(){
		System.out.print("□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■□■\n> ");
	}

}
